app/views/blogs/index.html.erb

SELECT COUNT(*) FROM "likes" WHERE "likes"."blog_id" = ?  [["blog_id", 9]]
---
		<td><%= blog.created_at.strftime "%m月%d日" %></td>
		<td> 💕<b><%= Like.where(blog_id: blog.id).count %></b></td>