app/views/blogs/show.html.erb

<p>
	<% if Like.find_by(user_id: login_PID , blog_id: @blog.id) %>
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."blog_id" = ? LIMIT ?  [["user_id", 0], ["blog_id", 16], ["LIMIT", 1]]

	<% end %>
	<%= Like.where(blog_id: @blog.id).count %>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."blog_id" = ?  [["blog_id", 16]]