app/controllers/blogs_controller.rb

SELECT "blogs".* FROM "blogs" ORDER BY "blogs"."created_at" ASC
---
  def index
    @blogs = Blog.all

INSERT INTO "blogs" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "1"], ["description", "111"], ["created_at", "2022-02-03 21:50:36.759522"], ["updated_at", "2022-02-03 21:50:36.759522"]]
---
  def create
    @blog = Blog.new(blog_params)

    respond_to do |format|
      if @blog.save

UPDATE "blogs" SET "description" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["description", "76t8mr78"], ["updated_at", "2022-02-14 23:27:49.573952"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)