app/controllers/blogs_controller.rb

UPDATE "blogs" SET "thumbup" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["thumbup", 1], ["updated_at", "2022-02-10 13:32:41.275136"], ["id", 11]]
---
  def update
    respond_to do |format|
      if @blog.update(blog_params)