app/controllers/comments_controller.rb

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
INSERT INTO "comments" ("comment", "blog_id", "created_at", "updated_at", "writer") VALUES (?, ?, ?, ?, ?)  [["comment", "47"], ["blog_id", 10], ["created_at", "2022-02-07 21:28:47.612687"], ["updated_at", "2022-02-07 21:28:47.612687"], ["writer", "aaa@aaa.aaa"]]
---
	def create
		@blog = Blog.find(params[:blog_id])
		@comment = @blog.comments.create(comment_params)

SELECT "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 10], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."blog_id" = ? AND "comments"."id" = ? LIMIT ?  [["blog_id", 10], ["id", 5], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = ?  [["id", 5]]
---
	def destroy
		@blog = Blog.find(params[:blog_id])
		@comment = @blog.comments.find(params[:id])
		@comment.destroy