app/controllers/likes_controller.rb

  def create
    @like = Like.new(user_id: @login_PID, blog_id: params[:blog_id])
    @like.save
---
INSERT INTO "likes" ("user_id", "blog_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 0], ["blog_id", 19], ["created_at", "2022-02-13 15:20:01.427993"], ["updated_at", "2022-02-13 15:20:01.427993"]]

  def destroy
    @like = Like.find_by(user_id: @login_PID, blog_id: params[:blog_id])
    @like.destroy
---
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? AND "likes"."blog_id" = ? LIMIT ?  [["user_id", 0], ["blog_id", 19], ["LIMIT", 1]]
DELETE FROM "likes" WHERE "likes"."id" = ?  [["id", 1]]