app/controllers/posts_controller.rb

INSERT INTO "posts" ("title", "content", "created_at", "updated_at", "writer") VALUES (?, ?, ?, ?, ?)  [["title", "44"], ["content", "55"], ["created_at", "2022-01-29 11:36:17.746708"], ["updated_at", "2022-01-29 11:36:17.746708"], ["writer", "2022-01-29 04:48:04 UTC"]]
---
  def create
	if user_signed_in?
		writer = current_user.email
	end
	  post=Post.create(title: params[:title], content: params[:content], writer: writer)

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
	  @post = Post.find(params[:ids])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 11], ["LIMIT", 1]]
UPDATE "posts" SET "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["content", "6245555"], ["updated_at", "2022-02-19 23:48:01.823688"], ["id", 11]]
---
  def update
	  post = Post.find(params[:id])
	  post.update(title: params[:title], content: params[:content])

SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 17]]
---
  def destroy
	  post = Post.find(params[:id])

	  if user_signed_in?
	  	if post.writer == current_user.email
		  post.destroy